In [26]:
import pandas as pd
import numpy as np

In [2]:
result = pd.read_table('./data/ex3.txt', sep='\s+')
print(type(result))
print(result)

<class 'pandas.core.frame.DataFrame'>
            A         B         C
aaa -2.046846 -1.315468 -0.258524
bbb -2.046846  8.315468       NaN
ccc -2.046846  5.187680 -0.258524
ddd -2.046846  0.315468 -1.258524

In [12]:
result = pd.read_table('./data/ex3.txt', sep='\s+', skiprows=[3, 4])
print(result)
print(result.info())

            A         B         C
aaa -2.046846 -1.315468 -0.258524
ddd -2.046846  0.315468 -1.258524
<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, aaa to ddd
Data columns (total 3 columns):
A    2 non-null float64
B    2 non-null float64
C    2 non-null float64
dtypes: float64(3)
memory usage: 64.0+ bytes
None

In [7]:
result = pd.read_table('./data/ex3.txt', sep='\s+', na_values={'B':0, 'C':-999})
print(result)
print(result.info())

            A         B         C
aaa -2.046846 -1.315468 -0.258524
bbb -2.046846  8.315468       NaN
ccc -2.046846  5.187680 -0.258524
ddd -2.046846  0.315468 -1.258524
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, aaa to ddd
Data columns (total 3 columns):
A    4 non-null float64
B    4 non-null float64
C    3 non-null float64
dtypes: float64(3)
memory usage: 128.0+ bytes
None

### 6.4 데이터베이스와 함께 사용하기 (p.264)

In [14]:
import sqlalchemy as sqla
import cx_Oracle
import pandas as pd

In [22]:
db = sqla.create_engine("oracle+cx_oracle://scott:oracle@127.0.0.1:1522/orcl")
result = pd.read_sql("select * from dept", db)
print(result)

   deptno       dname       loc
0      60          IT      None
1      10  ACCOUNTING  NEW YORK
2      20    RESEARCH    DALLAS
3      30       SALES   CHICAGO
4      40  OPERATIONS    BOSTON

C:\Users\student\Anaconda3\lib\site-packages\sqlalchemy\dialects\oracle\base.py:1273: SAWarning: Could not determine compatibility version: (cx_Oracle.DatabaseError) ORA-00942: 테이블 또는 뷰가 존재하지 않습니다
[SQL: SELECT value FROM v$parameter WHERE name = 'compatible']
(Background on this error at: http://sqlalche.me/e/4xp6)
  util.warn("Could not determine compatibility version: %s" % err)

# 8장 데이터 준비하기: 조인, 병합, 변형
## 8.1 계층적 색인

In [27]:
data = pd.Series(np.random.randn(9),
                index=[['a','a','a','b','b','c','c','d','d'],
                        [1,2,3,1,3,1,2,2,3]])
data

a  1   -0.382531
   2   -0.420768
   3   -0.638405
b  1   -0.174726
   3   -0.600090
c  1    0.189932
   2   -1.251293
d  2    0.189235
   3   -1.230481
dtype: float64

In [28]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [29]:
data['b']

1   -0.174726
3   -0.600090
dtype: float64

In [31]:
data.loc[['b','d']]

b  1   -0.174726
   3   -0.600090
d  2    0.189235
   3   -1.230481
dtype: float64

In [32]:
data.loc[:,2]

a   -0.420768
c   -1.251293
d    0.189235
dtype: float64

In [33]:
# unstack 메서드를 사용해서 데이터를 새롭게 배열할 수 있다.
data.unstack()

          1         2         3
a -0.382531 -0.420768 -0.638405
b -0.174726       NaN -0.600090
c  0.189932 -1.251293       NaN
d       NaN  0.189235 -1.230481

In [35]:
data.unstack().stack()

a  1   -0.382531
   2   -0.420768
   3   -0.638405
b  1   -0.174726
   3   -0.600090
c  1    0.189932
   2   -1.251293
d  2    0.189235
   3   -1.230481
dtype: float64

In [37]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index = [['a','a','b','b'], [1,2,1,2]],
                    columns=[['Ohio','Ohio','Colorado'],
                            ['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [38]:
frame.index.names = ['key1','key2']

In [39]:
frame.columns.names = ['state','color']

In [40]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [41]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 8.1.2 계층별 요약 통계

In [42]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [43]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 8.1.3 DataFrame의 컬럼 사용하기

In [44]:
frame = pd.DataFrame({'a':range(7), 
                     'b':range(7,0,-1),
                     'c':['one','one','one','two','two','two','two'],
                     'd':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [45]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

## 8.2 데이터 합치기

### 8.2.1 데이터베이스 스타일로 DataFrame 합치기

In [47]:
df1= pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                  'data1':range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [48]:
df2= pd.DataFrame({'key':['a','b','d'],
                  'data2':range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [51]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [52]:
pd.merge(df1,df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [55]:
df3 = pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],
                   'data1':range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [56]:
df4 = pd.DataFrame({'rkey':['a','b','d'],
                   'data2':range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [57]:
pd.merge(df3,df4,left_on='lkey', right_on='rkey')

# merge 함수는 기본적으로 내부조인을 수행햐여 교집합인 결과를 반환한다.

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0